Locked-Inc/STAR/star-esp32-firmware/lib/star_bus/src/star_bus_config.c
      ret = adc_cali_create_scheme_line_fitting(&cali_cfg, &config->proto.adc.cali_handle);
      if (ret == ESP_OK) {
        ESP_LOGI(s_TAG, "ADC calibration (line fitting) initialized for '%s'", bus_name);
      } else {
        ESP_LOGW(s_TAG,
                 "ADC calibration initialization failed for '%s': %s (continuing without "
                 "calibration)",
                 bus_name,
                 esp_err_to_name(ret));
        config->proto.adc.cali_handle = NULL;
      }
#else
      ESP_LOGW(s_TAG, "ADC calibration not supported on this chip, continuing without calibration");
      config->proto.adc.cali_handle = NULL;
#endif

      ESP_LOGI(s_TAG, "ADC bus '%s' initialized successfully", bus_name);
      break;

    fail_adc_unit:
      adc_oneshot_del_unit(config->proto.adc.unit_handle);
      config->proto.adc.unit_handle = NULL;
      goto fail;
    }

    default:
      ESP_LOGE(s_TAG, "Unsupported bus type for initialization: %d", config->type);
      ret = ESP_ERR_NOT_SUPPORTED;
      goto fail;
  }

  /* Mark as initialized */
  config->initialized = true;
  ESP_LOGI(s_TAG,
           "Successfully initialized bus/device '%s' (%s)",
           bus_name,
           star_bus_type_to_string(config->type));
  return ESP_OK;

/* Failure points with specific cleanup needs */
fail_i2c_driver:
  /* If driver install failed after param_config, no specific cleanup needed for param_config */
  goto fail;

fail_spi_add_device:
  /* If add_device failed, we might need to free the bus if we just initialized it */
  /* This logic is now handled by the manager during remove_bus */
  goto fail;

/* Generic failure point */
fail:
  ESP_LOGE(s_TAG, "Failed to initialize bus/device '%s'", bus_name);
  return ret;
}

esp_err_t star_bus_config_deinit(star_bus_config_t* config)
{
  ESP_RETURN_ON_FALSE(config, ESP_ERR_INVALID_ARG, s_TAG, "Config pointer is NULL");
  ESP_RETURN_ON_FALSE(config->initialized,
                      ESP_ERR_INVALID_STATE,
                      s_TAG,
                      "Bus/device '%s' is not initialized",
                      config->name ? config->name : "UNKNOWN");

  esp_err_t   ret      = ESP_OK;
  const char* bus_name = config->name ? config->name : "UNKNOWN";

  switch (config->type) {
    case k_star_bus_type_i2c:
      /* Deinitialize I2C bus */
      ESP_LOGI(s_TAG, "Deinitializing I2C bus '%s' (Port %d)", bus_name, config->proto.i2c.port);

      ret = i2c_driver_delete(config->proto.i2c.port);
      break;

    case k_star_bus_type_spi:
      if (config->proto.spi.is_peripheral) {
        /* SPI Peripheral Mode - Free the peripheral driver */
        ESP_LOGI(s_TAG,
                 "Deinitializing SPI peripheral '%s' (Host %d)",
                 bus_name,
                 config->proto.spi.host);
        ret = spi_slave_free(config->proto.spi.host);
      } else {
        /* SPI Controller Mode - Remove device */
        ESP_LOGI(s_TAG,
                 "Deinitializing SPI device '%s' (Host %d)",
                 bus_name,
                 config->proto.spi.host);
        if (config->handle) {
          ret            = spi_bus_remove_device((spi_device_handle_t)config->handle);
          config->handle = NULL;
        } else {
          ESP_LOGW(s_TAG, "SPI device '%s' handle was already NULL before deinit.", bus_name);
          ret = ESP_OK;
        }
      }
      break;

    case k_star_bus_type_gpio:
      /* GPIO pins don't need explicit deinitialization - they can be reconfigured anytime */
      ESP_LOGI(s_TAG, "Deinitializing GPIO bus '%s'", bus_name);
      ret = ESP_OK;
      break;

    case k_star_bus_type_adc:
      /* Deinitialize ADC */
      ESP_LOGI(s_TAG, "Deinitializing ADC bus '%s'", bus_name);

      /* Delete calibration if it was initialized */
      if (config->proto.adc.cali_handle) {
#if ADC_CALI_SCHEME_CURVE_FITTING_SUPPORTED
        ret = adc_cali_delete_scheme_curve_fitting(config->proto.adc.cali_handle);
#elif ADC_CALI_SCHEME_LINE_FITTING_SUPPORTED
        ret = adc_cali_delete_scheme_line_fitting(config->proto.adc.cali_handle);
#endif
        if (ret != ESP_OK) {
          ESP_LOGW(s_TAG,
                   "Failed to delete ADC calibration for '%s': %s",
                   bus_name,
                   esp_err_to_name(ret));
        }
        config->proto.adc.cali_handle = NULL;
      }

      /* Delete ADC unit */
      if (config->proto.adc.unit_handle) {
        ret = adc_oneshot_del_unit(config->proto.adc.unit_handle);
        config->proto.adc.unit_handle = NULL;
      }
      break;

    default:
      ESP_LOGE(s_TAG, "Unsupported bus type for deinitialization: %d", config->type);
      ret = ESP_ERR_NOT_SUPPORTED;
      break;
  }

  if (ret != ESP_OK) {
    ESP_LOGE(s_TAG, "Failed to deinitialize bus/device '%s': %s", bus_name, esp_err_to_name(ret));
    /* Do not return early, mark as uninitialized anyway */
  }

  /* Mark as not initialized */
  config->initialized = false;
  config->handle      = NULL; /* Clear handle */

  if (ret == ESP_OK) {
    ESP_LOGI(s_TAG, "Successfully deinitialized bus/device '%s'", bus_name);
  }

  return ret; /* Return the ret of the deinit operation */
}

/* --- Private Functions --- */

/**
 * @brief Clean up and free memory for a bus configuration structure.
 *        Does NOT deinitialize the hardware/driver.
 * @param[in] config Pointer to the bus configuration to clean up.
 */
static void internal_star_bus_config_cleanup(star_bus_config_t* config)
{
  if (config == NULL) {
    return;
  }

  /* Free the name if it was allocated (strdup'd in create_common) */
  if (config->name) {
    free((void*)config->name); /* Cast needed as it's stored as const char* */
    config->name = NULL;
  }

  /* Clear other pointers */
  config->handle   = NULL;
  config->user_ctx = NULL;
  config->next     = NULL;

  /* Free the bus configuration structure itself */
  free(config);
}

/**
 * @brief Create a generic bus configuration structure and allocate memory.
 *
 * @param[in] name Name of the bus (will be duplicated). Must not be NULL.
 * @param[in] type Type of the bus.
 * @return star_bus_config_t* Pointer to the created configuration, or NULL on failure.
 */
static star_bus_config_t* internal_star_bus_config_create_common(const char*     name,
                                                                 star_bus_type_t type)
{
  /* Name validation */
  if (name == NULL) {
    ESP_LOGE(s_TAG, "Bus name cannot be NULL");
    return NULL;
  }

  /* Allocate memory for the bus configuration */
  star_bus_config_t* config = (star_bus_config_t*)malloc(sizeof(star_bus_config_t));
  if (config == NULL) {
    ESP_LOGE(s_TAG, "Failed to allocate memory for bus configuration");
    return NULL;
  }

  /* Initialize the configuration to zeros */
  memset(config, 0, sizeof(star_bus_config_t));

  /* Make a copy of the bus name */
  char* name_copy = strdup(name);
  if (name_copy == NULL) {
    ESP_LOGE(s_TAG, "Failed to allocate memory for bus name");
    free(config);
    return NULL;
  }
  config->name = name_copy; /* Store the copy */

  /* Set common parameters */
  config->type        = type;
  config->initialized = false;
  config->handle      = NULL;
  config->user_ctx    = NULL;
  config->next        = NULL;

  /* Initialize callback structs to NULL */
  memset(&config->proto.i2c.callbacks, 0, sizeof(config->proto.i2c.callbacks));
  memset(&config->proto.spi.callbacks, 0, sizeof(config->proto.spi.callbacks));

  return config;
}
